uhnp/src/InformationRegisters/СчетаУчетаЧАдляАПСП/СчетаУчетаЧАдляАПСП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаУчетаЧАдляАПСП</name>
  <resources>
    <name>СчетДляМДУ</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <dimensions>
    <name>СчетЧА</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СчетаУчетаЧАдляАПСП/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ПодготовитьФормуНаСервере(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПодготовитьФормуНаСервере(Форма)
	
	Форма.КэшируемыеЗначения = Новый Структура;
	Форма.КэшируемыеЗначения.Вставить("ИменаСубконто", 		РегистрыСведений.СчетаУчетаЧАдляАПСП.ПолучитьИменаСубонто());
	
	ПланСчетовБД = Форма.Запись.ПланСчетовБД;
	
	Если Не ЗначениеЗаполнено(ПланСчетовБД) Тогда
		ПланСчетовБД = МСФОКлиентСерверУХ.ПланСчетовПараметровУчета(Форма.Запись.СчетЧА);
		Форма.Запись.ПланСчетовБД = ПланСчетовБД;
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
	ПараметрыВыбораИсточник = Новый Массив;
	ПараметрыВыбораИсточник.Добавить(Новый ПараметрВыбора("Владелец", ПланСчетовБД));
	ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораИсточник);	
	
	Для каждого ИмяСчета Из Форма.КэшируемыеЗначения.ИменаСубконто Цикл
		Форма.Элементы[ИмяСчета.Ключ].ПараметрыВыбора = ПараметрыВыбора;		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
